Revit 2017 API
Rebar.GetEndTreatmentTypeId Method
 Get the id of the EndTreatmentType to be applied to the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2009
Syntax
C#
public ElementId GetEndTreatmentTypeId(
	int end
)
Visual Basic
Public Function GetEndTreatmentTypeId ( _
	end As Integer _
) As ElementId
Visual C++
public:
ElementId^ GetEndTreatmentTypeId(
	int end
)
Parameters
end
Type: System.Int32
 0 for the start end treatment, 1 for the end end treatment.
Return Value
 The id of a EndTreatmentType, or invalidElementId if the rebar has no end treatment at the specified end.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  end must be 0 or 1.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace